apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_partition.c
  mtd = esp32s3_spiflash_mtd();
  if (!mtd)
    {
      ferr("ERROR: Failed to get SPI flash MTD\n");
      ret = -ENOSYS;
      goto errout_with_mtd;
    }

  mtd_encrypt = esp32s3_spiflash_encrypt_mtd();
  if (!mtd_encrypt)
    {
      ferr("ERROR: Failed to get SPI flash encrypted MTD\n");
      ret = -ENOSYS;
      goto errout_with_mtd;
    }

  /* Even without SPI Flash encryption, we can also use encrypted
   * MTD to read no-encrypted data.
   */

  ret = MTD_READ(mtd_encrypt, PARTITION_TABLE_OFFSET,
                 PARTITION_MAX_SIZE, pbuf);
  if (ret != PARTITION_MAX_SIZE)
    {
      ferr("ERROR: Failed to get read data from MTD\n");
      ret = -EIO;
      goto errout_with_mtd;
    }

  info = (struct partition_info_priv_s *)pbuf;
  encrypt = esp32s3_flash_encryption_enabled();
  for (i = 0; i < num; i++)
    {
      char *name;

      if (info->magic != PARTITION_MAGIC)
        {
          break;
        }

      strlcpy(label, (char *)info->label, sizeof(label));
      snprintf(path, sizeof(path), "%s%s", path_base, label);
      mtd_ll = mtd;

      /* If SPI Flash encryption is enable, "APP", "OTA data" and "NVS keys"
       * are force to set as encryption partition.
       */

      flags = info->flags;
      if (encrypt)
        {
          if ((info->type == PARTITION_TYPE_DATA &&
              info->subtype == PARTITION_SUBTYPE_DATA_OTA) ||
              (info->type == PARTITION_TYPE_DATA &&
              info->subtype == PARTITION_SUBTYPE_DATA_NVS_KEYS))
            {
              flags |= PARTITION_FLAG_ENCRYPTED;
            }
        }

      finfo("INFO: [label]:   %s\n", label);
      finfo("INFO: [type]:    %d\n", info->type);
      finfo("INFO: [subtype]: %d\n", info->subtype);
      finfo("INFO: [offset]:  0x%08" PRIx32 "\n", info->offset);
      finfo("INFO: [size]:    0x%08" PRIx32 "\n", info->size);
      finfo("INFO: [flags]:   0x%08" PRIx32 "\n", info->flags);
      finfo("INFO: [mount]:   %s\n", path);
      if (encrypt && (flags & PARTITION_FLAG_ENCRYPTED))
        {
          mtd_ll = mtd_encrypt;
          finfo("INFO: [encrypted]\n\n");
        }
      else
        {
          mtd_ll = mtd;
          finfo("INFO: [no-encrypted]\n\n");
        }

      ret = MTD_IOCTL(mtd_ll, MTDIOC_GEOMETRY, (unsigned long)&geo);
      if (ret < 0)
        {
          ferr("ERROR: Failed to get info from MTD\n");
          goto errout_with_mtd;
        }

      mtd_priv = kmm_malloc(sizeof(struct mtd_dev_priv_s));
      if (!mtd_priv)
        {
          ferr("ERROR: Failed to allocate %d byte\n",
               sizeof(struct mtd_dev_priv_s));
          ret = -ENOMEM;
          goto errout_with_mtd;
        }

      mtd_priv->offset  = info->offset;
      mtd_priv->size    = info->size;
      mtd_priv->type    = info->type;
      mtd_priv->subtype = info->subtype;
      mtd_priv->flags   = flags;
      mtd_priv->ll_mtd  = mtd_ll;
      memcpy(&mtd_priv->geo, &geo, sizeof(geo));

      mtd_priv->mtd.bread  = esp32s3_part_bread;
      mtd_priv->mtd.bwrite = esp32s3_part_bwrite;
      mtd_priv->mtd.erase  = esp32s3_part_erase;
      mtd_priv->mtd.ioctl  = esp32s3_part_ioctl;
      mtd_priv->mtd.read   = esp32s3_part_read;
      mtd_priv->mtd.write  = esp32s3_part_write;
      mtd_priv->mtd.name   = name = strdup(label);
      if (!name)
        {
          ferr("ERROR: Failed to allocate MTD name\n");
          kmm_free(mtd_priv);
          ret = -ENOSPC;
          goto errout_with_mtd;
        }

      mtd_priv->part_mtd = mtd_partition(&mtd_priv->mtd,
                                         info->offset / geo.blocksize,
                                         info->size / geo.blocksize);
      if (!mtd_priv->part_mtd)
        {
          ferr("ERROR: Failed to create MTD partition\n");
          lib_free(name);
          kmm_free(mtd_priv);
          ret = -ENOSPC;
          goto errout_with_mtd;
        }

      ret = register_mtddriver(path, mtd_priv->part_mtd, 0777, NULL);
      if (ret < 0)
        {
          ferr("ERROR: Failed to register MTD @ %s\n", path);
          lib_free(name);
          kmm_free(mtd_priv);
          goto errout_with_mtd;
        }

      info++;
    }

  ret = 0;

errout_with_mtd:
  kmm_free(pbuf);

errout_with_malloc:
  return ret;
}

/****************************************************************************
 * Name: esp32s3_partition_read
 *
 * Description:
 *   Read data from SPI Flash at designated address.
 *
 * Input Parameters:
 *   label  - Partition label
 *   offset - Offset in SPI Flash
 *   buf    - Data buffer pointer
 *   size   - Data number
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

int esp32s3_partition_read(const char *label, size_t offset, void *buf,
                           size_t size)
{
  int ret;
  int partion_offset;
  DEBUGASSERT(label != NULL && buf != NULL);
  struct mtd_dev_s *mtd = esp32s3_spiflash_mtd();
  if (!mtd)
    {
      ferr("ERROR: Failed to get SPI flash MTD\n");
      return -ENOSYS;
    }

  partion_offset = partition_get_offset(label, sizeof(label));
  if (partion_offset < 0)
    {
      ferr("ERROR: Failed to get partition: %s offset\n", label);
      return partion_offset;
    }

  ret = MTD_READ(mtd, partion_offset + offset,
                 size, (uint8_t *)buf);
  if (ret != size)
    {
      ferr("ERROR: Failed to get read data from MTD\n");
      return -EIO;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_partition_read_decrypt
 *
 * Description:
 *   Read data from SPI Flash at designated address (with decryption)
 *
 * Input Parameters:
 *   label  - Partition label
 *   offset - Offset in SPI Flash
 *   buf    - Data buffer pointer
 *   size   - Data number
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

int esp32s3_partition_read_decrypt(const char *label, size_t offset,
                                   void *buf, size_t size)
{
  int ret;
  int partion_offset;
  DEBUGASSERT(label != NULL && buf != NULL);
  struct mtd_dev_s *mtd = esp32s3_spiflash_encrypt_mtd();
  if (!mtd)
    {
      ferr("ERROR: Failed to get SPI flash MTD\n");
      return -ENOSYS;
    }

  partion_offset = partition_get_offset(label, strlen(label));
  if (partion_offset < 0)
    {
      ferr("ERROR: Failed to get partition: %s offset\n", label);
      return partion_offset;
    }

  ret = MTD_READ(mtd, partion_offset + offset,
                 size, (uint8_t *)buf);
  if (ret != size)
    {
      ferr("ERROR: Failed to get read data from MTD\n");
      return -EIO;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_partition_write
 *
 * Description:
 *   Write data to SPI Flash at designated address.
 *
 * Input Parameters:
 *   label  - Partition label
 *   offset - Offset in SPI Flash
 *   buf    - Data buffer pointer
 *   size   - Data number
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

int esp32s3_partition_write(const char *label, size_t offset, void *buf,
                            size_t size)
{
  int ret;
  int partion_offset;
  DEBUGASSERT(label != NULL && buf != NULL);
  struct mtd_dev_s *mtd = esp32s3_spiflash_mtd();
  if (!mtd)
    {
      ferr("ERROR: Failed to get SPI flash MTD\n");
      return -ENOSYS;
    }

  partion_offset = partition_get_offset(label, sizeof(label));
  if (partion_offset < 0)
    {
      ferr("ERROR: Failed to get partition: %s offset\n", label);
      return partion_offset;
    }

  ret = MTD_WRITE(mtd, partion_offset + offset,
                  size, (uint8_t *)buf);
  if (ret != size)
    {
      ferr("ERROR: Failed to get read data from MTD\n");
      return -EIO;
    }

  return OK;
}
